doubletInjector/0/k.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 6;

boundaryField
{

    walls
    {
    	type		kqRWallFunction;
    	value		$internalField;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.air;
        inletValue      $internalField;
        value           $internalField;
    }
    upperInlet
    {
        type            fixedValue;
        value		 uniform 6;
    }
    lowerInlet
    {
        type            fixedValue;
        value		 uniform 6;
    }
    frontAndBack
    {
    	type		 symmetry;
    }

}


// ************************************************************************* //
