doubletInjector/0/nut.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls
    {
    	type            nutkWallFunction;
        value           uniform 0;
    }
    upperInlet
    {
        type            calculated;
        value           uniform 0;
    }
    lowerInlet
    {
    	type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        phi             phi.air;
        value           uniform 0;
    }
    frontAndBack
    {
        type		 symmetry;
    }

}

// ************************************************************************* //
