doubletInjector/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          230;
        startFace       34399;
    }
    lowerInlet
    {
        type            patch;
        nFaces          1;
        startFace       34629;
    }
    upperInlet
    {
        type            patch;
        nFaces          1;
        startFace       34630;
    }
    outlet
    {
        type            patch;
        nFaces          370;
        startFace       34631;
    }
    frontAndBack
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          34700;
        startFace       35001;
    }
)

// ************************************************************************* //
